 gdb a.out
GNU gdb (Ubuntu 8.1.1-0ubuntu1) 8.1.1
Copyright (C) 2018 Free Software Foundation, Inc.
License GPLv3+: GNU GPL version 3 or later <http://gnu.org/licenses/gpl.html>
This is free software: you are free to change and redistribute it.
There is NO WARRANTY, to the extent permitted by law.  Type "show copying"
and "show warranty" for details.
This GDB was configured as "x86_64-linux-gnu".
Type "show configuration" for configuration details.
For bug reporting instructions, please see:
<http://www.gnu.org/software/gdb/bugs/>.
Find the GDB manual and other documentation resources online at:
<http://www.gnu.org/software/gdb/documentation/>.
For help, type "help".
Type "apropos word" to search for commands related to "word"...
Reading symbols from a.out...done.
(gdb) b main
Breakpoint 1 at 0x772: file p11original.c, line 7.
(gdb) r
Starting program: /home/runner/pps-test1-Tushar-sham-1/a.out 
warning: Error disabling address space randomization: Operation not permitted

Breakpoint 1, main () at p11original.c:7
7   {
(gdb) n
10   printf("enter a and b where a + ib is the complex number.\n");
(gdb) n
enter a and b where a + ib is the complex number.
11   scanf("%d%d", &a.real, &a.img);
(gdb) n
n
12   printf("enter c and d where c + id is the second complex number.\n");
(gdb) n
enter c and d where c + id is the second complex number.
13   scanf("%d%d", &b.real, &b.img);
(gdb) n
15   c.real = a.real + b.real;
(gdb) n
16   c.img = a.img + b.img;
(gdb) n
18   printf("sum of the complex numbers: (%d) + (%di)\n", c.real, c.img);
(gdb) n
sum of the complex numbers: (1895829136) + (44138i)
20   return 0;
(gdb) n
21  }(gdb) n
__libc_start_main (main=0x56353880076a <main>, argc=1, 
    argv=0x7fff8e5a2cf8, init=<optimized out>, fini=<optimized out>, 
    rtld_fini=<optimized out>, stack_end=0x7fff8e5a2ce8)
    at ../csu/libc-start.c:344
344 ../csu/libc-start.c: No such file or directory.
(gdb) s
__GI_exit (status=0) at exit.c:139
139 exit.c: No such file or directory.
(gdb) p
The history is empty.
(gdb) c
Continuing.
[Inferior 1 (process 264) exited normally]
(gdb) l
134 in exit.c
(gdb) quit
