#include <stdio.h>

int input_size_array(){
  int n;
  printf("enter the number of input: ");
  scanf("%d" , &n);
  return n;
}

void input_array(int n, int a[n]){
  for(int i=0; i<n; i++){
    printf("enter a number: ");
    scanf("%d", &a[i]);
  }
}

int sum_n_arrays(int n, int a[n]){
  int sum=0;
  for(int i=0; i<n; i++){
    sum += a[i];
  }
  return sum;
}

void output(int n, int a[n], int sum){
  for(int i=0; i<n-1; i++){
    printf("%d+" , a[i]);
  }
printf("%d is %d\n" , a[n-1], sum);
}
int main()
{
  int n = input_size_array();
  int a[n];
  input_array(n, a);
  int sum = sum_n_arrays(n, a);
  output (n, a, sum);
  return 0;
}  
 gdb a.out
GNU gdb (Ubuntu 8.1.1-0ubuntu1) 8.1.1
Copyright (C) 2018 Free Software Foundation, Inc.
License GPLv3+: GNU GPL version 3 or later <http://gnu.org/licenses/gpl.html>
This is free software: you are free to change and redistribute it.
There is NO WARRANTY, to the extent permitted by law.  Type "show copying"
and "show warranty" for details.
This GDB was configured as "x86_64-linux-gnu".
Type "show configuration" for configuration details.
For bug reporting instructions, please see:
<http://www.gnu.org/software/gdb/bugs/>.
Find the GDB manual and other documentation resources online at:
<http://www.gnu.org/software/gdb/documentation/>.
For help, type "help".
Type "apropos word" to search for commands related to "word"...
Reading symbols from a.out...done.
(gdb) b main
Breakpoint 1 at 0x8ab: file p7final.c, line 32.
(gdb) r
Starting program: /home/runner/pps-test1-Tushar-sham-1/a.out 
warning: Error disabling address space randomization: Operation not permitted

Breakpoint 1, main () at p7final.c:32
32  {
(gdb) n
33    int n = input_size_array();
(gdb) n
enter the number of input: 
n
34    int a[n];
(gdb) n
35    input_array(n, a);
(gdb) n
36    int sum = sum_n_arrays(n, a);
(gdb) n
37    output (n, a, sum);
(gdb) n
22067 is 0
38    return 0;
(gdb) n
39  }  
(gdb) s
__libc_start_main (
    main=0x56338180089a <main>, 
    argc=1, argv=0x7fff685ce968, 
    init=<optimized out>, 
    fini=<optimized out>, 
    rtld_fini=<optimized out>, 
    stack_end=0x7fff685ce958)
    at ../csu/libc-start.c:344
344 ../csu/libc-start.c: No such file or directory.
(gdb) p
The history is empty.
(gdb) c
Continuing.
[Inferior 1 (process 388) exited normally]
(gdb) l
339 in ../csu/libc-start.c
(gdb) quit
~/pps-test1-Tushar-sham-1$ gcc -g p7original.c