#include <stdio.h>
float input()
{
  float n; 
  printf("enter a number :");
  scanf("%f", &n);
  return n;
  }

  float my_sqrt(float n)
  {
    if(n == 0 || n == 1)
    {
      return n;
    }
  
  float i = 1, ans = 1;
  while(ans <=n)
  {
    i++;
    ans = i * 1;
  }
  return i - 1;
  }

void output(float n, float sqrt_result)
{
  printf("the square root of %0.2f is: %0.2f\n", n,sqrt_result);
}
 int main()
 {
   float n = input();
   float sqrt_result = my_sqrt(n);
   output(n, sqrt_result);
   return 0;
 }
gdb a.out
GNU gdb (Ubuntu 8.1.1-0ubuntu1) 8.1.1
Copyright (C) 2018 Free Software Foundation, Inc.
License GPLv3+: GNU GPL version 3 or later <http://gnu.org/licenses/gpl.html>
This is free software: you are free to change and redistribute it.
There is NO WARRANTY, to the extent permitted by law.  Type "show copying"
and "show warranty" for details.
This GDB was configured as "x86_64-linux-gnu".
Type "show configuration" for configuration details.
For bug reporting instructions, please see:
<http://www.gnu.org/software/gdb/bugs/>.
Find the GDB manual and other documentation resources online at:
<http://www.gnu.org/software/gdb/documentation/>.
For help, type "help".
Type "apropos word" to search for commands related to "word"...
Reading symbols from a.out...done.
(gdb) b main
Breakpoint 1 at 0x847: file p8original.c, line 32.
(gdb) r
Starting program: /home/runner/pps-test1-Tushar-sham-1/a.out 
warning: Error disabling address space randomization: Operation not permitted

Breakpoint 1, main ()
    at p8original.c:32
32     float n = input();
(gdb) n
enter a number :n
33     float sqrt_result = my_sqrt(n);
(gdb) n
34     output(n, sqrt_result);
(gdb) n
the square root of 0.00 is: 0.00
35     return 0;
(gdb) n
36   }
(gdb) n
__libc_start_main (
    main=0x55f0a260083f <main>, 
    argc=1, argv=0x7ffcd6c16b08, 
    init=<optimized out>, 
    fini=<optimized out>, 
    rtld_fini=<optimized out>, 
    stack_end=0x7ffcd6c16af8)
    at ../csu/libc-start.c:344
344 ../csu/libc-start.c: No such file or directory.
(gdb) s
__GI_exit (status=0) at exit.c:139
139 exit.c: No such file or directory.
(gdb) p
The history is empty.
(gdb) c
Continuing.
[Inferior 1 (process 3246) exited normally]
(gdb) l
134 in exit.c
(gdb) quit
