 gdb a.out
GNU gdb (Ubuntu 8.1.1-0ubuntu1) 8.1.1
Copyright (C) 2018 Free Software Foundation, Inc.
License GPLv3+: GNU GPL version 3 or later <http://gnu.org/licenses/gpl.html>
This is free software: you are free to change and redistribute it.
There is NO WARRANTY, to the extent permitted by law.  Type "show copying"
and "show warranty" for details.
This GDB was configured as "x86_64-linux-gnu".
Type "show configuration" for configuration details.
For bug reporting instructions, please see:
<http://www.gnu.org/software/gdb/bugs/>.
Find the GDB manual and other documentation resources online at:
<http://www.gnu.org/software/gdb/documentation/>.
For help, type "help".
Type "apropos word" to search for commands related to "word"...
Reading symbols from a.out...done.
(gdb) b main
Breakpoint 1 at 0x772: file p9original.c, line 5.
(gdb) r
Starting program: /home/runner/pps-test1-Tushar-sham-1/a.out 
warning: Error disabling address space randomization: Operation not permitted

Breakpoint 1, main () at p9original.c:5
5   {
(gdb) 
(gdb) n
9     printf("enter the first string : ");
(gdb) 
10    scanf("%s",str1);
(gdb) n
enter the first string : n
11    printf("enter the second string : ");
(gdb) n
12    scanf("%s",str2);
(gdb) n
enter the second string : n
14    value=strcmp(str1,str2);
(gdb) n
15    if(value==0)
(gdb) n
16    printf("string are same");
(gdb) n
19    return 0;
(gdb) n
20  }
(gdb) s
__libc_start_main (main=0x5594d580076a <main>, argc=1, argv=0x7ffd3446ed28, 
    init=<optimized out>, fini=<optimized out>, rtld_fini=<optimized out>, 
    stack_end=0x7ffd3446ed18) at ../csu/libc-start.c:344
344 ../csu/libc-start.c: No such file or directory.
(gdb) p
The history is empty.
(gdb) c
Continuing.
string are same[Inferior 1 (process 592) exited normally]
(gdb) l
339 in ../csu/libc-start.c
(gdb) quit
